posts/2015-02-15-transfiguration-sunday-prayer.org
#+date: <2015-02-15>
#+filetags: prayer religion
#+title: Transfiguration Sunday Prayer

Father,

In the blindness of our arrogance,\\
we think that we are free,\\
yet, so often, we are in chains,\\
slaves to the satisfaction of our own desires,\\
and to the pursuit of our own selfish ends.\\

Our prayer today is that\\
we may be transformed,\\
freed, so that we may\\
live as Christ lived,\\
and love as he loved,\\
every moment of our lives\\
an act of restoration and redemption,\\
and our faith a witness to\\
coming of the Kingdom of God,\\
when the justice of the Father\\
and the love of the Son,\\
rule together with the power of the Spirit.\\
in perfect fullness and harmony.

Let these gifts today be\\
the first acts of our new lives.\\

/Amen/


#+begin_tagline
Tagged: prayer religion
#+end_tagline
