docs/posts/2015-02-15-transfiguration-sunday-prayer.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Transfiguration Sunday Prayer</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/atom.xml">Feed</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Transfiguration Sunday Prayer</h1>
<p class="subtitle" role="doc-subtitle">Feb 15, 2015</p>
</header><p>
Father,
</p>

<p>
In the blindness of our arrogance,<br>
we think that we are free,<br>
yet, so often, we are in chains,<br>
slaves to the satisfaction of our own desires,<br>
and to the pursuit of our own selfish ends.<br>
</p>

<p>
Our prayer today is that<br>
we may be transformed,<br>
freed, so that we may<br>
live as Christ lived,<br>
and love as he loved,<br>
every moment of our lives<br>
an act of restoration and redemption,<br>
and our faith a witness to<br>
coming of the Kingdom of God,<br>
when the justice of the Father<br>
and the love of the Son,<br>
rule together with the power of the Spirit.<br>
in perfect fullness and harmony.
</p>

<p>
Let these gifts today be<br>
the first acts of our new lives.<br>
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="orgfa8bb63">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
